dotfiles/config/doom/README.org
#+TITLE: Bloodstiller Dev Doom Config
#+AUTHOR: blooodstiller
#+DESCRIPTION: Bloodstiller Personal Doom Emacs Config.
#+PROPERTY: header-args :tangle /home/martin/.config/doom/config.el
#+auto_tangle: t
#+STARTUP: showeverything

* TABLE OF CONTENTS :TOC:
:PROPERTIES:
:ID:       b541533f-3271-4bc6-8dcb-bdd0dc44261b
:END:
- [[#literate-config][Literate Config:]]
- [[#doom-main-config][Doom Main Config:]]
  - [[#general-settings][General Settings:]]
  - [[#fonts--theme][Fonts & Theme:]]
  - [[#bookmarks-and-buffers][BOOKMARKS AND BUFFERS]]
  - [[#org-mode][ORG MODE:]]
  - [[#markdown][Markdown:]]
  - [[#quality-of-life][Quality Of Life:]]
- [[#packagesel][packages.el:]]
- [[#initel][init.el]]
- [[#customel][custom.el]]

* Literate Config:
:PROPERTIES:
:ID:       98115602-c008-4e0b-8d95-497de1561a6c
:END:
- This is my personal Doom Emacs config it is structured as a literate configuration.
- Inspired by the methodology presented at [[https://leanpub.com/lit-config/read][Literate Configuration]].
- This approach blends detailed documentation directly with the code, offering clear insights into the purpose and functionality of each configuration snippet, making it both user-friendly and easy to maintain.
- Great video by DT Tube here on how to write literate configs:
  - https://www.youtube.com/watch?v=eF4cJlBNtdQ&themeRefresh=1
- /Alot of this is lifted from DT Tube but with my own customization etc./ However please check out his config and videos https://gitlab.com/dwt1/distro.tube
* Doom Main Config:
:PROPERTIES:
:ID:       20a5b90c-8c46-4037-bb1e-ee9fefda1e30
:header-args: :tangle ~/.config/doom/config.el
:END:
** General Settings:
:PROPERTIES:
:ID:       553f0eaf-80e3-4469-935c-e5170383929e
:END:
*** User Information:
:PROPERTIES:
:ID:       f90ccfeb-6d1d-4a63-8f3d-5d50eb92c69f
:END:

#+begin_src emacs-lisp
(setq user-full-name "bloodstiller")
#+end_src

*** Set line Numbers:
:PROPERTIES:
:ID:       18a53005-4942-4a48-a723-e2cc16ab8548
:END:
#+begin_src emacs-lisp
;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type t)
#+end_src
*** Beacon:
:PROPERTIES:
:ID:       c2f8ec18-84bb-4079-85a8-17157bb2478b
:END:
Never lose your cursor.  When you scroll, your cursor will shine!  This is a global minor-mode. Turn it on everywhere with:

#+begin_src emacs-lisp
(beacon-mode 1)
#+end_src
*** Graphics: Pixel-precision scrolling:
:PROPERTIES:
:ID:       9f605124-95d4-4246-88aa-bf1a4bd38edc
:END:
#+begin_src emacs-lisp
(when (version< "29.0.50" emacs-version)
  (pixel-scroll-precision-mode))
#+end_src
** Fonts & Theme:
:PROPERTIES:
:ID:       d62adafd-65fc-4a25-aad9-9a96ab7d7e82
:END:
Settings related to fonts within Doom Emacs:

  - ‘doom-font’ – standard monospace font that is used for most things in Emacs.
  - ‘doom-variable-pitch-font’ – variable font which is useful in some Emacs plugins.
  - ‘doom-big-font’ – used in doom-big-font-mode; useful for presentations.
  - ‘font-lock-comment-face’ – for comments.
  - ‘font-lock-keyword-face’ – for keywords with special significance like ‘setq’ in elisp.

#+begin_src emacs-lisp
;;Select my preffered theme:
;;(setq doom-theme 'doom-dracula)
;;(setq doom-theme 'modus-vivendi)
;;(load-theme 'tron-legacy t)
;;(setq doom-theme 'doom-nord)
(setq doom-theme 'doom-one)


;;(setq  doom-font (font-spec :family "Iosevka Nerd Font" :size 16)
(setq  doom-font (font-spec :family "JetBrains Mono" :size 18)
       doom-variable-pitch-font (font-spec :family "Iosevka Nerd Font")
       doom-unicode-font (font-spec :family "Symbols Nerd Font Mono" :size 16))

;;(custom-theme-set-faces! 'tron-legacy
  ;;`(tree-sitter-hl-face:constructor :foreground ,(doom-color 'blue))
  ;;`(tree-sitter-hl-face:number :foreground ,(doom-color 'orange))
  ;;`(tree-sitter-hl-face:attribute :foreground ,(doom-color 'magenta) :weight bold)
  ;;`(tree-sitter-hl-face:variable :foreground ,(doom-color 'base7) :weight bold)
  ;;`(tree-sitter-hl-face:variable.builtin :foreground ,(doom-color 'red))
  ;;`(tree-sitter-hl-face:constant.builtin :foreground ,(doom-color 'magenta) :weight bold)
  ;;`(tree-sitter-hl-face:constant :foreground ,(doom-color 'blue) :weight bold)
  ;;`(tree-sitter-hl-face:function.macro :foreground ,(doom-color 'teal))
  ;;`(tree-sitter-hl-face:label :foreground ,(doom-color 'magenta))
  ;;`(tree-sitter-hl-face:operator :foreground ,(doom-color 'blue))
  ;;`(tree-sitter-hl-face:variable.parameter :foreground ,(doom-color 'cyan))
  ;;`(tree-sitter-hl-face:punctuation.delimiter :foreground ,(doom-color 'cyan))
  ;;`(tree-sitter-hl-face:punctuation.bracket :foreground ,(doom-color 'cyan))
  ;;`(tree-sitter-hl-face:punctuation.special :foreground ,(doom-color 'cyan))
  ;;`(tree-sitter-hl-face:type :foreground ,(doom-color 'yellow))
  ;;`(tree-sitter-hl-face:type.builtin :foreground ,(doom-color 'blue))
  ;;`(tree-sitter-hl-face:tag :foreground ,(doom-color 'base7))
  ;;`(tree-sitter-hl-face:string :foreground ,(doom-color 'green))
  ;;`(tree-sitter-hl-face:comment :foreground ,(doom-color 'base6))
  ;;`(tree-sitter-hl-face:function :foreground ,(doom-color 'cyan))
  ;;`(tree-sitter-hl-face:method :foreground ,(doom-color 'blue))
  ;;`(tree-sitter-hl-face:function.builtin :foreground ,(doom-color 'cyan))
  ;;`(tree-sitter-hl-face:property :foreground ,(doom-color 'blue))
  ;;`(tree-sitter-hl-face:keyword :foreground ,(doom-color 'magenta))
  ;;`(corfu-default :font "Iosevka Nerd Font Mono" :background ,(doom-color 'bg-alt) :foreground ,(doom-color 'fg))
  ;;`(adoc-title-0-face :foreground ,(doom-color 'blue) :height 1.2)
  ;;`(adoc-title-1-face :foreground ,(doom-color 'magenta) :height 1.1)
  ;;`(adoc-title-2-face :foreground ,(doom-color 'violet) :height 1.05)
  ;;`(adoc-title-3-face :foreground ,(doom-lighten (doom-color 'blue) 0.25) :height 1.0)
  ;;`(adoc-title-4-face :foreground ,(doom-lighten (doom-color 'magenta) 0.25) :height 1.1)
  ;;`(adoc-verbatim-face :background nil)
  ;;`(adoc-list-face :background nil)
  ;;`(adoc-internal-reference-face :foreground ,(face-attribute 'font-lock-comment-face :foreground)))


; Set preffered fonts:
;;(setq doom-font (font-spec :family "JetBrains Mono" :size 20)
      ;;doom-variable-pitch-font (font-spec :family "JetBrains Mono" :size 15)
      ;;doom-big-font (font-spec :family "JetBrains Mono" :size 24))
;;(after! doom-themes
  ;;(setq doom-themes-enable-bold t
        ;;doom-themes-enable-italic t))
;;(custom-set-faces!
  ;;'(font-lock-comment-face :slant italic)
  ;;'(font-lock-keyword-face :slant italic))
#+end_src

** BOOKMARKS AND BUFFERS
:PROPERTIES:
:ID:       40af9b48-1c3a-4a6c-a76e-36645ec2c333
:END:
Doom Emacs uses 'SPC b' for keybindings related to bookmarks and buffers.

*** Bookmarks
:PROPERTIES:
:ID:       71ba80a9-22e3-4934-9706-2aa05e0aadf4
:END:
Bookmarks are somewhat like registers in that they record positions you can jump to.  Unlike registers, they have long names, and they persist automatically from one Emacs session to the next. The prototypical use of bookmarks is to record where you were reading in various files.

| COMMAND         | DESCRIPTION                            | KEYBINDING |
|-----------------+----------------------------------------+------------|
| list-bookmarks  | _List bookmarks_                         | SPC b L    |
| bookmark-set    | _Set bookmark_                           | SPC b m    |
| bookmark-delete | _Delete bookmark_                        | SPC b M    |
| bookmark-save   | _Save current bookmark to bookmark file_ | SPC b w    |

#+BEGIN_SRC emacs-lisp
;;Setup Bookmarks
(setq bookmark-default-file "~/.config/doom/bookmarks/")

(map! :leader
      (:prefix ("b". "buffer")
       :desc "List bookmarks"                          "L" #'list-bookmarks
       :desc "Set bookmark"                            "m" #'bookmark-set
       :desc "Delete bookmark"                         "M" #'bookmark-set
       :desc "Save current bookmarks to bookmark file" "w" #'bookmark-save))
#+END_SRC

*** Buffers
:PROPERTIES:
:ID:       db998fe8-01b0-4a9d-95af-b7d05eb9c3f7
:END:
Regarding buffers, the text you are editing in Emacs resides in an object called a buffer. Each time you visit a file, a buffer is used to hold the file’s text. Each time you invoke Dired, a buffer is used to hold the directory listing.  Ibuffer is a program that lists all of your Emacs buffers/, allowing you to navigate between them and filter them.
j
| COMMAND         | DESCRIPTION          | KEYBINDING |
|-----------------+----------------------+------------|
| ibuffer         | _Launch ibuffer_       | SPC b i    |
| kill-buffer     | _Kill current buffer_  | SPC b k    |
| next-buffer     | _Goto next buffer_     | SPC b n    |
| previous-buffer | _Goto previous buffer_ | SPC b p    |
| save-buffer     | _Save current buffer_  | SPC b s    |

*** Keybindings within ibuffer mode:
:PROPERTIES:
:ID:       a3d611b3-548c-4c06-bb67-2695b6062e64
:END:
| COMMAND                           | DESCRIPTION                            | KEYBINDING |
|-----------------------------------+----------------------------------------+------------|
| ibuffer-mark-forward              | _Mark the buffer_                        | m          |
| ibuffer-unmark-forward            | _Unmark the buffer_                      | u          |
| ibuffer-do-kill-on-deletion-marks | _Kill the marked buffers_                | x          |
| ibuffer-filter-by-content         | _Ibuffer filter by content_              | f c        |
| ibuffer-filter-by-directory       | _Ibuffer filter by directory_            | f d        |
| ibuffer-filter-by-filename        | _Ibuffer filter by filename (full path)_ | f f        |
| ibuffer-filter-by-mode            | _Ibuffer filter by mode_                 | f m        |
| ibuffer-filter-by-name            | _Ibuffer filter by name_                 | f n        |
| ibuffer-filter-disable            | _Disable ibuffer filter_                 | f x        |
| ibuffer-do-kill-lines             | _Hide marked buffers_                    | g h        |
| ibuffer-update                    | _Restore hidden buffers_                 | g H        |

#+begin_src emacs-lisp
(evil-define-key 'normal ibuffer-mode-map
  (kbd "f c") 'ibuffer-filter-by-content
  (kbd "f d") 'ibuffer-filter-by-directory
  (kbd "f f") 'ibuffer-filter-by-filename
  (kbd "f m") 'ibuffer-filter-by-mode
  (kbd "f n") 'ibuffer-filter-by-name
  (kbd "f x") 'ibuffer-filter-disable
  (kbd "g h") 'ibuffer-do-kill-lines
  (kbd "g H") 'ibuffer-update)
#+end_src

*** Global Auto Revert
:PROPERTIES:
:ID:       f2f913de-6630-41fa-98a6-161c56929db5
:END:
A buffer can get out of sync with respect to its visited file on disk if that file is changed by another program. To keep it up to date, you can enable Auto Revert mode by typing M-x auto-revert-mode, or you can set it to be turned on globally with 'global-auto-revert-mode'.  I have also turned on Global Auto Revert on non-file buffers, which is especially useful for 'dired' buffers.

#+begin_src emacs-lisp
;;Global Auto Revert
(global-auto-revert-mode 1)
(setq global-auto-revert-non-file-buffers t)
#+end_src

** ORG MODE:
:PROPERTIES:
:ID:       e29c8aff-47e4-4b4d-b794-b2cd4726466d
:END:
- This is where the vast majority of my customization lies. As I live mostly in ORG Mode.
