dotfiles/config/doom/config.el
(setq user-full-name "bloodstiller")

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type t)

(beacon-mode 1)

(when (version< "29.0.50" emacs-version)
  (pixel-scroll-precision-mode))

;;Select my preffered theme:
;;(setq doom-theme 'doom-dracula)
;;(setq doom-theme 'modus-vivendi)
;;(load-theme 'tron-legacy t)
;;(setq doom-theme 'doom-nord)
(setq doom-theme 'doom-one)


;;(setq  doom-font (font-spec :family "Iosevka Nerd Font" :size 16)
(setq  doom-font (font-spec :family "JetBrains Mono" :size 18)
       doom-variable-pitch-font (font-spec :family "Iosevka Nerd Font")
       doom-unicode-font (font-spec :family "Symbols Nerd Font Mono" :size 16))

;;(custom-theme-set-faces! 'tron-legacy
  ;;`(tree-sitter-hl-face:constructor :foreground ,(doom-color 'blue))
  ;;`(tree-sitter-hl-face:number :foreground ,(doom-color 'orange))
  ;;`(tree-sitter-hl-face:attribute :foreground ,(doom-color 'magenta) :weight bold)
  ;;`(tree-sitter-hl-face:variable :foreground ,(doom-color 'base7) :weight bold)
  ;;`(tree-sitter-hl-face:variable.builtin :foreground ,(doom-color 'red))
  ;;`(tree-sitter-hl-face:constant.builtin :foreground ,(doom-color 'magenta) :weight bold)
  ;;`(tree-sitter-hl-face:constant :foreground ,(doom-color 'blue) :weight bold)
  ;;`(tree-sitter-hl-face:function.macro :foreground ,(doom-color 'teal))
  ;;`(tree-sitter-hl-face:label :foreground ,(doom-color 'magenta))
  ;;`(tree-sitter-hl-face:operator :foreground ,(doom-color 'blue))
  ;;`(tree-sitter-hl-face:variable.parameter :foreground ,(doom-color 'cyan))
  ;;`(tree-sitter-hl-face:punctuation.delimiter :foreground ,(doom-color 'cyan))
  ;;`(tree-sitter-hl-face:punctuation.bracket :foreground ,(doom-color 'cyan))
  ;;`(tree-sitter-hl-face:punctuation.special :foreground ,(doom-color 'cyan))
  ;;`(tree-sitter-hl-face:type :foreground ,(doom-color 'yellow))
  ;;`(tree-sitter-hl-face:type.builtin :foreground ,(doom-color 'blue))
  ;;`(tree-sitter-hl-face:tag :foreground ,(doom-color 'base7))
  ;;`(tree-sitter-hl-face:string :foreground ,(doom-color 'green))
  ;;`(tree-sitter-hl-face:comment :foreground ,(doom-color 'base6))
  ;;`(tree-sitter-hl-face:function :foreground ,(doom-color 'cyan))
  ;;`(tree-sitter-hl-face:method :foreground ,(doom-color 'blue))
  ;;`(tree-sitter-hl-face:function.builtin :foreground ,(doom-color 'cyan))
  ;;`(tree-sitter-hl-face:property :foreground ,(doom-color 'blue))
  ;;`(tree-sitter-hl-face:keyword :foreground ,(doom-color 'magenta))
  ;;`(corfu-default :font "Iosevka Nerd Font Mono" :background ,(doom-color 'bg-alt) :foreground ,(doom-color 'fg))
  ;;`(adoc-title-0-face :foreground ,(doom-color 'blue) :height 1.2)
  ;;`(adoc-title-1-face :foreground ,(doom-color 'magenta) :height 1.1)
  ;;`(adoc-title-2-face :foreground ,(doom-color 'violet) :height 1.05)
  ;;`(adoc-title-3-face :foreground ,(doom-lighten (doom-color 'blue) 0.25) :height 1.0)
  ;;`(adoc-title-4-face :foreground ,(doom-lighten (doom-color 'magenta) 0.25) :height 1.1)
  ;;`(adoc-verbatim-face :background nil)
  ;;`(adoc-list-face :background nil)
  ;;`(adoc-internal-reference-face :foreground ,(face-attribute 'font-lock-comment-face :foreground)))


; Set preffered fonts:
;;(setq doom-font (font-spec :family "JetBrains Mono" :size 20)
      ;;doom-variable-pitch-font (font-spec :family "JetBrains Mono" :size 15)
      ;;doom-big-font (font-spec :family "JetBrains Mono" :size 24))
;;(after! doom-themes
  ;;(setq doom-themes-enable-bold t
        ;;doom-themes-enable-italic t))
;;(custom-set-faces!
  ;;'(font-lock-comment-face :slant italic)
  ;;'(font-lock-keyword-face :slant italic))

;;Setup Bookmarks
(setq bookmark-default-file "~/.config/doom/bookmarks/")

(map! :leader
      (:prefix ("b". "buffer")
       :desc "List bookmarks"                          "L" #'list-bookmarks
       :desc "Set bookmark"                            "m" #'bookmark-set
       :desc "Delete bookmark"                         "M" #'bookmark-set
       :desc "Save current bookmarks to bookmark file" "w" #'bookmark-save))

(evil-define-key 'normal ibuffer-mode-map
  (kbd "f c") 'ibuffer-filter-by-content
  (kbd "f d") 'ibuffer-filter-by-directory
  (kbd "f f") 'ibuffer-filter-by-filename
  (kbd "f m") 'ibuffer-filter-by-mode
  (kbd "f n") 'ibuffer-filter-by-name
  (kbd "f x") 'ibuffer-filter-disable
  (kbd "g h") 'ibuffer-do-kill-lines
  (kbd "g H") 'ibuffer-update)

;;Global Auto Revert
(global-auto-revert-mode 1)
(setq global-auto-revert-non-file-buffers t)
