dotfiles/config/doom/README.org
*** ORG - Org Directory:
:PROPERTIES:
:ID:       76e97e74-4782-42b9-9d0b-070f7917ffab
:END:
- If you use `org' and don't want your org files in the default location below,
  - change `org-directory'. It must be set before org loads!
#+begin_src emacs-lisp
(setq org-directory "/home/martin/Dropbox/01-09_System/01-Emacs/01.02-OrgGtd/")

(setq org-agenda-files '("/home/martin/Dropbox/01-09_System/01-Emacs/01.02-OrgGtd/inbox.org"
                         "/home/martin/Dropbox/01-09_System/01-Emacs/01.02-OrgGtd/org-gtd-tasks.org"
                         "/home/martin/Dropbox/01-09_System/01-Emacs/01.02-OrgGtd/gtd_archive_2023"))
#+end_src

*** ORG - Todo States:
:PROPERTIES:
:ID:       f0b68567-17a7-4ff9-9f4e-694a7be21747
:END:
Custom TODO states & Tags
#+begin_src emacs-lisp
;; CUSTOM org TODO states
(after! org
(setq org-todo-keywords
      '((sequence "TODO(t)"
         "NEXT(n)"
         "PLANNING(p)"
         "IN-PROGRESS(i)"
         "WEEKLY-GOAL(m)"
         "GOAL(g)"
         "WAITING(w)"
         "WORK(b)"
         "HABIT(h)"
         "PROJECT(P)"
         "CALENDAR(c)"
         "NOTE(N)"
         "AREA(a)"
         "|"
         "DONE(d!)"
         "COMPLETE(C!)"
         "HOLD(h)"
         "SOMEDAY(s)"
         "RABBITHOLE!(R)")
        )))

;; CUSTOM TODO colors
(after! org
(setq org-todo-keyword-faces
      '(
        ("TODO" . (:foreground "#ffdd83" :weight bold))
        ("NEXT" . (:foreground "light coral" :weight bold))
        ("PLANNING" . (:foreground "#bd7091" :weight bold))
        ("IN-PROGRESS" . (:foreground "#ffb86c" :weight bold))
        ("WEEKLY-GOAL" . (:foreground "light sea green" :weight bold))
        ("GOAL" . (:foreground "LimeGreen" :weight bold))
        ("WAITING" . (:foreground "LightPink1" :weight bold))
        ("WORK" . (:foreground "Cyan" :weight bold))
        ("HABIT" . (:foreground "RoyalBlue3" :weight bold))
        ("PROJECT" . (:foreground "SlateBlue1" :weight bold))
        ("CALENDAR" . (:foreground "chocolate" :weight bold))
        ("NOTE" . (:foreground "#7d9dc0" :background "#ffb86c" :weight bold))
        ("AREA" . (:foreground "#7d9dc0" :weight bold))

        ("DONE" . (:foreground "white" :weight bold))
        ("COMPLETE" . (:strikethrough t :foreground "light gray" :weight bold))
        ("HOLD" . (:foreground "Grey46" :weight bold))
        ("SOMEDAY" . (:foreground "cyan1" :weight bold))
        )))

;; Custom Tag colors
(setq org-tag-faces
      '(
        ("planning"  . (:foreground "mediumPurple1" :weight bold))
        ("@research"   . (:foreground "royalblue1"    :weight bold))
        ("QA"        . (:foreground "sienna"        :weight bold))
        ("CRITICAL"  . (:foreground "red1"          :weight bold))
        ("HABIT"  . (:foreground "pink"          :weight bold))
        )
      )
#+end_src

*** ORG - Shortcuts to Open Files:
:PROPERTIES:
:ID:       745563d5-468d-4272-a8d3-f38418349513
:END:

Keybindings to open files that I work with all the time using the find-file command, which is the interactive file search that opens with ~'C-x C-f'~ in GNU Emacs or ~'SPC f f'~ in Doom Emacs.

These keybindings use find-file non-interactively since we specify exactly what file to open.  The format I use for these bindings is ~'SPC ='~ plus ~'key'~ since Doom Emacs does not use ~'SPC ='~.

_NOTE_: Doom Emacs already has a function 'doom/open-private-config' set to the keybinding 'SPC f p'.  This allows you to open any file in your HOME/.config/doom directory, so the following keybindings that I created are not really necessary, but I created this section as an example of how to to create bindings that open specific files on your system.

| **PATH TO FILE**                                                 | **DESCRIPTION**                    | **KEYBINDING** |
|----------------------------------------------------------------+----------------------------------+--------------|
| ~/Dropbox/01-09_System/01-Emacs/01.02-OrgGtd/org-gtd-tasks.org | Opens TODO file                  | SPC = t      |
| ~/Dropbox/01-09_System/01-Emacs/01.02-OrgGtd/Goals.org         | Edit Goals file                  | SPC = g      |
| ~/Dropbox/01-09_System/01-Emacs/01.02-OrgGtd/inbox.org         | Edit inbox file                  | SPC = i      |
|----------------------------------------------------------------+----------------------------------+--------------|
| ~/.config/doom/README.org                                      | Edit Doom config.el              | SPC = d c    |
|----------------------------------------------------------------+----------------------------------+--------------|
| ~/Dropbox/40-49_Career/44-Blog/                                | Open Blog Root Folder            | SPC = b r    |
| ~/Dropbox/40-49_Career/44-Blog/index.org                       | Edit Index.org file              | SPC = b i    |
| ~/Dropbox/40-49_Career/44-Blog/Articles/Blog.org               | Edit Blog.org file               | SPC = b b    |
| ~/Dropbox/40-49_Career/44-Blog/Emacs.org                       | Edit Emacs.org file              | SPC = b e    |
| ~/Dropbox/40-49_Career/44-Blog/Infosec.org                     | Edit Infosec.org file            | SPC = b I    |
|----------------------------------------------------------------+----------------------------------+--------------|
| ~/Dropbox/00Projects/                                          | Open Projects Folder             | SPC = p p    |
| ~/Dropbox/01-09_System/                                        | Open Systems Folder              | SPC = p 0    |
| ~/Dropbox/10-19_Health/                                        | Open Health Folder               | SPC = p 1    |
| ~/Dropbox/20-29_Home/                                          | Open Home Folder                 | SPC = p 2    |
| ~/Dropbox/30-39_Relationships/                                 | Open Relationships Folder        | SPC = p 3    |
| ~/Dropbox/40-49_Career/                                        | Open Career Folder               | SPC = p 4    |
| ~/Dropbox/50-59_PersonalDevelopment/                           | Open Personal Development Folder | SPC = p 5    |
| ~/Dropbox/60-69_Work/                                          | Open Work Folder                 | SPC = p 6    |
| ~/Dropbox/70-79_Finances/                                      | Open Finances Folder             | SPC = p 7    |
| ~/Dropbox/80-89_Hobbies/                                       | Open Hobbies Folder              | SPC = p 8    |
| ~/Dropbox/90-99_Repos/                                         | Open Repos Folder                | SPC = p 9    |
|----------------------------------------------------------------+----------------------------------+--------------|


#+begin_src emacs-lisp
(map! :leader
      (:prefix ("=" . "open file")
       :desc "Edit TODO File" "t" #'(lambda () (interactive) (find-file "/home/martin/Dropbox/01-09_System/01-Emacs/01.02-OrgGtd/org-gtd-tasks.org"))
       :desc "Edit Goals File"   "g" #'(lambda () (interactive) (find-file "/home/martin/Dropbox/01-09_System/01-Emacs/01.02-OrgGtd/Goals.org"))
       :desc "Edit inbox File" "i" #'(lambda () (interactive) (find-file "/home/martin/Dropbox/01-09_System/01-Emacs/01.02-OrgGtd/inbox.org"))))

(map! :leader
      (:prefix ("= d" . "Open Doom Config")
       :desc "Edit Doom config.el"   "c" #'(lambda () (interactive) (find-file "/home/martin/.config/doom/README.org"))))

(map! :leader
      (:prefix ("= b" . "Open Blog Files")
       :desc "Open Blog Root Folder"   "r" #'(lambda () (interactive) (find-file "~/.config/hugo/bloodstiller"))
       :desc "Edit Index.org file"   "i" #'(lambda () (interactive) (find-file "/home/martin/Dropbox/40-49_Career/44-Blog/index.org"))
       :desc "Edit Blog.org file"   "b" #'(lambda () (interactive) (find-file "/home/martin/Dropbox/40-49_Career/44-Blog/Articles/Blog.org"))
       :desc "Edit Emacs.org file"   "e" #'(lambda () (interactive) (find-file "/home/martin/Dropbox/40-49_Career/44-Blog/Emacs.org"))
       :desc "Edit Infosec.org file"   "I" #'(lambda () (interactive) (find-file "/home/martin/Dropbox/40-49_Career/44-Blog/Infosec.org"))))
(map! :leader
      (:prefix ("= p" . "Open areas/Projects")
       :desc "Open Projects Folder" "p" #'(lambda () (interactive) (find-file "/home/martin/Dropbox/00Projects"))
       :desc "Open Systems Folder" "0" #'(lambda () (interactive) (find-file "/home/martin/Dropbox/01-09_System"))
       :desc "Open Health Folder" "1" #'(lambda () (interactive) (find-file "/home/martin/Dropbox/10-19_Health"))
       :desc "Open Home Folder" "2" #'(lambda () (interactive) (find-file "/home/martin/Dropbox/20-29_Home"))
       :desc "Open Relationships Folder" "3" #'(lambda () (interactive) (find-file "/home/martin/Dropbox/30-39_Relationships"))
       :desc "Open Career Folder" "4" #'(lambda () (interactive) (find-file "/home/martin/Dropbox/40-49_Career"))
       :desc "Open Personal Development Folder" "5" #'(lambda () (interactive) (find-file "/home/martin/Dropbox/50-59_PersonalDevelopment"))
       :desc "Open Work Folder" "6" #'(lambda () (interactive) (find-file "/home/martin/Dropbox/60-69_Work"))
       :desc "Open Finances Folder" "7" #'(lambda () (interactive) (find-file "/home/martin/Dropbox/70-79_Finances"))
       :desc "Open Hobbies Folder" "8" #'(lambda () (interactive) (find-file "/home/martin/Dropbox/80-89_Hobbies"))
       :desc "Open Repos Folder" "9" #'(lambda () (interactive) (find-file "/home/martin/Dropbox/90-99_Repos"))))
#+end_src
