dotfiles/config/doom/README.org
*** ORG - Drag and Drop Files Easily & Attach:
:PROPERTIES:
:ID:       cfc78081-d49a-43db-8163-8f182d59d9b1
:END:
- This still does not work (unsure why).
#+begin_src emacs-lisp
(require 'org-download)
(setq-default org-download-image-dir "/home/martin/Dropbox/screenshots/")
;;Allows dropping to dir-ed
(add-hook 'dired-mode-hook 'org-download-enable)

#+end_src

*** ORG - Set ATTACH Directory:
:PROPERTIES:
:ID:       1c5ee3a0-b4bc-49df-9086-52337c770f97
:END:
- Actually Set ATTACH directory where images are stored
#+begin_src emacs-lisp
(setq org-attach-directory "/home/martin/Dropbox/screenshots/")
#+end_src

*** ORG - Auto Tangle:
:PROPERTIES:
:ID:       abe65ea9-84ae-4813-a26c-3d92835a6d32
:END:

- By adding this ~#+PROPERTY: header-args :tangle /Directory/name_of_file.extension~ to any org file I can output the code block contents to the specified location.

#+begin_src emacs-lisp

;; Enables auto tangling/exporting of code blocks to a unified code file form org mode.
(use-package! org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode)
  :config
  (setq org-auto-tangle-default t))

#+end_src

*** ORG - Start all documents in overview mode:
:PROPERTIES:
:ID:       fa1c25e1-02c7-45f1-92ff-8c9e2a474e25
:END:
- I have large org files with lots of nested headings, this makes it less cumbersome.
#+begin_src emacs-lisp
(setq org-startup-folded t)

#+end_src

*** ORG - Add ID to all ORG headindgs on save:
:PROPERTIES:
:ID:       d646dd8f-c35f-4058-a9ac-26fb8ec0e5ab
:END:
- Add ID to all ORG headindgs on save:
  - I want the option to be able to import org roam if need be. This adds ID's to all headings so I can then easily back link.
#+begin_src emacs-lisp
(add-hook 'org-capture-prepare-finalize-hook 'org-id-get-create)
(defun my/org-add-ids-to-headlines-in-file ()
;  "Add ID properties to all headlines in the current file which
;do not already have one."
  (interactive)
  (org-map-entries 'org-id-get-create))
(add-hook 'org-mode-hook
          (lambda ()
            (add-hook 'before-save-hook 'my/org-add-ids-to-headlines-in-file nil 'local)))
#+end_src

*** ORG - Cosmetics:
:PROPERTIES:
:ID:       d2397cc9-f813-473e-9bab-c1559c7c4801
:END:
**** Cosmetics - Export with smart quotes:
:PROPERTIES:
:ID:       b1d5ffa4-9843-4b35-bd8e-66586ae4ce92
:END:
- I use custom smart quotes so this helps me have them remain when exporting.
#+begin_src emacs-lisp
;; Export using my custom smart quotes.
(setq org-export-with-smart-quotes t)
#+end_src

**** Cosmetics - Hide Emphasis Markers:
:PROPERTIES:
:ID:       628eec6c-1afa-438a-bd7d-f6044a8990d0
:END:
- This means that the markers used for emphasis will no longer be visible and instead just the outcome.

#+begin_src emacs-lisp

;; Hide emphasis markers in text this means that MD and org syntax icons will not show
;; effectively acts as preview.

(after! org
(setq org-hide-emphasis-markers t))

#+end_src

**** Cosmetics - Colour Configuration:
:PROPERTIES:
:ID:       f3932cf6-e0f3-49e7-ab03-dc105a59ed6c
:END:
#+begin_src emacs-lisp

;;Customize ORG higlighting
;; this controls the color of bold, italic, underline, verbatim, strikethrough

    ;; Purple Bold & Underline Brighter purple Dracula purple "#A061F9"
    ;; Red text highligted in yellow (important)
    ;; Dracula setup ("/" (:weight black :background "#FF5555" :foreground "#F1FA8C" ))
    ;; Blue
    ;;Higlighter  brighter yellow "#F1FA8C"
    ;; Code block
    ;; Green Background Option Dracula:
    ;;("~" (:background "#6BB86B" :foreground "#575a71" ))
    ;; Red = Important red
    ;; Red for dracula theme "#FF5555"
    ;;("+" (bold :strike-through nil :foreground "#ffb86c" #cd5c5c )))))

(after! org
(setq org-emphasis-alist
  '(("*" (underline :weight black :foreground "#EB00E4" ))
   ;; ("/" (:weight black :background "#745B00" :foreground "#FF3D2B" ))
    ("_" (:weight black :foreground "#79c6ff" ))
    ("=" (underline :weight black :foreground "#b18c00" ))
    ("~" (:foreground "#6BB86B" ))
    ("+" (underline bold :weight italic :foreground "#FF3D2B" )))))

#+end_src

**** Cosmetics - Headline Bullets and Folds:
:PROPERTIES:
:ID:       801b5f53-05e7-4ca6-a193-c3525b8d7f33
:END:
#+begin_src emacs-lisp
(setq org-superstar-headline-bullets-list '("› "))
#+end_src
**** Cosmetics - Item Bullets:
:PROPERTIES:
:ID:       17b3ea4d-35d1-4850-9402-0316d1469cf2
:END:
- Custom bulleted list
#+begin_src emacs-lisp

(setq org-superstar-item-bullet-alist '((?* . ?⋆)
                                        (?+ . ?‣)
                                        (?- . ?•)))

#+end_src
**** Cosmetics - Dropdown Icon:
:PROPERTIES:
:ID:       e52b4479-8c54-4516-92a4-71d3b3ce6a3b
:END:
- Custom drop down icon.
#+begin_src emacs-lisp
(setq org-ellipsis " ⯯")
#+end_src

**** Cosmetics - Ligatures:
:PROPERTIES:
:ID:       603b1fff-d06a-4693-a20a-c441a0d817c7
:END:
- Stolen from https://github.com/elken/doom
#+begin_src emacs-lisp
(setq-hook! org-mode
  prettify-symbols-alist '(("#+end_quote" . "”")
                           ("#+END_QUOTE" . "”")
                           ("#+begin_quote" . "“")
                           ("#+BEGIN_QUOTE" . "“")
                           ("#+end_src" . "«")
                           ("#+END_SRC" . "«")
                           ("#+begin_src" . "»")
                           ("#+BEGIN_SRC" . "»")
                           ("#+name:" . "»")
                           ("#+NAME:" . "»")))
#+end_src

**** Cosmetics - Indent Content under Headings:
:PROPERTIES:
:ID:       f5188c3b-c984-4637-aa9d-01e5828397d2
:END:
#+begin_src emacs-lisp
(setq org-adapt-indentation t)
#+end_src
**** Cosmetics - Indent All Org Files:
:PROPERTIES:
:ID: f055195a-06c5-4eba-a98b-382c1901de26
:END:
#+begin_src emacs-lisp
(require 'org-indent)
(setq org-startup-indented t)
#+end_src

*** ORG - ROAM:
:PROPERTIES:
:ID:       d2fc4b3c-393e-4a18-a03c-2cf3dcd7c11d
:END:
**** Roam - Location:
:PROPERTIES:
:ID:       2f17e7b4-9201-4924-ae58-d7be6a5b6894
:END:
- Set Roam Main Dir
#+begin_src emacs-lisp
(require 'org-roam)
(setq org-roam-directory "~/Dropbox")

#+end_src

**** Roam - (make git ignored files in subdirectories still searchable)
:PROPERTIES:
:ID:       d248366b-fa72-457c-abba-d0ef83e8a540
:END:
- Roam - (make git ignored files in subdirectories still searchable)
#+begin_src emacs-lisp
(after! org-roam
  (setq org-roam-list-files-commands '(find fd fdfind rg)))

#+end_src
**** Roam - Capture Templates:
:PROPERTIES:
:ID:       0b82e2bd-d707-4757-97bf-8c912fce2043
:END:
| **Path To Template**                              | **Description** | **Keybinding** |
|-------------------------------------------------+---------------+--------------|
| ~/.config/orgTemplates/Application.org          | Application   | A            |
| ~/.config/orgTemplates/AttackTemplate.org       | Attack Type   | a            |
| ~/.config/orgTemplates/BoxTemplate.org          | Box           | b            |
| ~/.config/orgTemplates/CPTSSection.org          | CPTS Module   | c            |
| ~/.config/orgTemplates/DailyReview.org          | Daily Review  | d            |
| ~/.config/orgTemplates/Pentest.org              | New Pentest   | p            |
| ~/.config/orgTemplates/ProjectStartTemplate.org | Start Project | n            |
| ~/.config/orgTemplates/ProjectEndTemplate.org   | End Project   | N            |
| ~/.config/orgTemplates/ServiceTemplate.org      | Service       | s            |
| ~/.config/orgTemplates/ToolTemplate.org         | Tool          | t            |
|-------------------------------------------------+---------------+--------------|

#+begin_src emacs-lisp
;Roam - Capture Templates:
(setq org-roam-capture-templates
'(("d" "default" plain
      "%?"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
      :unnarrowed t)

 ("A" "Application" plain
  (file "~/.config/orgTemplates/Application.org")
  :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
  :unnarrowed t)

 ("a" "Attack Type" plain
  (file "~/.config/orgTemplates/AttackTemplate.org")
  :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
  :unnarrowed t)

 ("b" "Box" plain
  (file "~/.config/orgTemplates/BoxTemplate.org")
  :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
  :unnarrowed t)

 ("c" "CPTS Module" plain
  (file "~/.config/orgTemplates/CPTSSection.org")
  :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
  :unnarrowed t)

 ("d" "Daily Review" plain
  (file "~/.config/orgTemplates/DailyReview.org")
  :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
  :unnarrowed t)

  ("p" "Pentest" plain
  (file "~/.config/orgTemplates/Pentest.org")
  :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
  :unnarrowed t)


 ("n" "Start Project" plain
  (file "~/.config/orgTemplates/ProjectStartTemplate.org")
  :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
  :unnarrowed t)

 ("N" "End Project" plain
  (file "~/.config/orgTemplates/ProjectEndTemplate.org")
  :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
  :unnarrowed t)

  ("s" "Service" plain
  (file "~/.config/orgTemplates/ServiceTemplate.org")
  :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
  :unnarrowed t)

 ("t" "Tool" plain
  (file "~/.config/orgTemplates/ToolTemplate.org")
  :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
  :unnarrowed t)))
#+end_src

**** Roam - Render Large Files Faster:
:PROPERTIES:
:ID:       7160b423-b9b2-4244-bc8f-2d392e3bb157
:END:
- I have very large files for some things so this helps
  - Taken from: https://github.com/org-roam/org-roam/issues/2399

#+begin_src emacs-lisp
(defun vr/org-roam-buffer-render-contents-advice (orig-fun &rest args)
  (let ((org-startup-indented nil))
    (apply orig-fun args)))
(advice-add 'org-roam-buffer-render-contents :around #'vr/org-roam-buffer-render-contents-advice)
#+end_src

