dotfiles/config/doom/README.org
*** ORG - Hugo Auto Export:
:PROPERTIES:
:ID:       7636b429-40ef-4ccf-8252-8c9480f39afb
:END:
#+begin_src emacs-lisp
(use-package ox-hugo
  :after org
  :config
  (setq org-hugo-base-dir "/home/martin/.config/hugo/bloodstiller")

  (defun my/ensure-hugo-title (file)
    "Ensure the file has a #+title: keyword, adding one based on the filename if missing."
    (with-current-buffer (find-file-noselect file)
      (goto-char (point-min))
      (unless (re-search-forward "^#\\+title:" nil t)
        (goto-char (point-min))
        (insert (format "#+title: %s\n\n"
                        (file-name-base (file-name-nondirectory file))))
        (save-buffer))
      (current-buffer)))

  (defun my/get-hugo-section (file)
    "Get the Hugo section for the file based on its front matter."
    (with-current-buffer (find-file-noselect file)
      (goto-char (point-min))
      (if (re-search-forward "^#\\+hugo_section:\\s-*\\(.*\\)$" nil t)
          (match-string-no-properties 1)
        "posts")))  ; default to "posts" if no specific section is found

  (defun my/org-roam-link-to-hugo-link (link desc)
    "Convert an Org-roam link to a Hugo internal link or plain text if file is missing."
    (let* ((id (org-element-property :path link))
           (node (org-roam-node-from-id id))
           (file (when node (org-roam-node-file node)))
           (title (or desc (when node (org-roam-node-title node)) "Unknown")))
      (if (and file (file-exists-p file))
          (format "{{< ref \"%s\" >}}" (file-name-sans-extension (file-name-nondirectory file)))
        (format "*%s*" title))))  ; Use italic text for missing links

  (defun my/export-org-to-hugo (file)
    "Export a single org file to Hugo markdown."
    (with-current-buffer (my/ensure-hugo-title file)
      (message "Exporting %s" file)
      (condition-case err
          (let* ((org-export-with-broken-links t)
                 (section (my/get-hugo-section file))
                 (org-hugo-section section)
                 (org-export-before-parsing-hook '(org-roam-bibtex-replace-links
                                                   org-roam-replace-roam-links))
                 (org-hugo-link-org-files-as-md t)
                 (org-link-parameters '(("id" :export my/org-roam-link-to-hugo-link))))
            (org-hugo-export-wim-to-md)
            (message "Exported %s to section: %s" file section))
        (error
         (message "Error exporting %s: %s" file (error-message-string err))))
      (kill-buffer)))

  (defun my/export-all-org-files ()
    "Export all org files in content-org/ to Hugo markdown."
    (interactive)
    (let ((org-files (directory-files-recursively
                      (expand-file-name "content-org" org-hugo-base-dir)
                      "\\.org$")))
      (dolist (file org-files)
        (my/export-org-to-hugo file))))

  (defun my/maybe-export-all-on-save ()
    (when (and (buffer-file-name)
               (string-prefix-p
                (expand-file-name "content-org" org-hugo-base-dir)
                (buffer-file-name)))
      (message "File in content-org saved, exporting all files...")
      (my/export-all-org-files)
      (message "All files exported")))

  (add-hook 'after-save-hook #'my/maybe-export-all-on-save))

;; Directory local variables for content-org/
(dir-locals-set-class-variables
 'hugo-content-org
 '((org-mode . ((eval . (org-hugo-auto-export-mode))))))

(dir-locals-set-directory-class
 (expand-file-name "content-org" org-hugo-base-dir)
 'hugo-content-org)

(message "ox-hugo configuration loaded")
#+end_src
** Markdown:
:PROPERTIES:
:ID:       fb90e51d-e4eb-43cc-8bcf-3970bf57e8a2
:END:
- Why have MD customization when I have org. Sometimes when writing reports this is the best option as it's compatible accross the board and doesn't require exporting, which with my custom org markers can be cumbersome.
*** Markdown: Line Numbers Display:
:PROPERTIES:
:ID:       1cd30d6b-d28b-4f79-a426-423874dc4d30
:END:
#+begin_src emacs-lisp
;; Markdown & line settings

;;(setq display-line-numbers-type t)
;;(map! :leader
      ;;:desc "Comment or uncomment lines" "TAB TAB" #'comment-line
      ;;(:prefix ("t" . "toggle")
       ;;:desc "Toggle line numbers" "l" #'doom/toggle-line-numbers
       ;;:desc "Toggle line highlight in frame" "h" #'hl-line-mode
       ;;:desc "Toggle line highlight globally" "H" #'global-hl-line-mode
       ;;:desc "Toggle truncate lines" "t" #'toggle-truncate-lines))
#+end_src
*** Markdown: Set Custom Headers:
:PROPERTIES:
:ID:       ebc51896-42f8-4d70-bba9-6dc4d2123d93
:END:

#+begin_src emacs-lisp

;Markdown: Set Custom Headers:
;;(custom-set-faces!
 ;; Headers

;;'(markdown-header-delimiter-face :foreground "#616161" :height 0.9)
;;'(markdown-header-face-1 :height 1.8 :foreground "#FF79C6" :weight extra-bold :inherit markdown-header-face)
;;'(markdown-header-face-2 :height 1.4 :foreground "#BD93F9" :weight extra-bold :inherit markdown-header-face)
;;'(markdown-header-face-3 :height 1.2 :foreground "#D4B8FB" :weight extra-bold :inherit markdown-header-face)
;;'(markdown-header-face-4 :height 1.15 :foreground "#FFA7D9" :weight bold :inherit markdown-header-face)
;;'(markdown-header-face-5 :height 1.1 :foreground "#E4D3FC" :weight bold :inherit markdown-header-face)
;;'(markdown-header-face-6 :height 1.05 :foreground "#5e81ac" :weight semi-bold :inherit markdown-header-face)

;;; Custom bold etc

;;'(markdown-code-face :background "#6BB86B" :foreground "#575a71")
;;'(markdown-line-break-face :weight extra-black :foreground "#79c6ff")
;;'(markdown-italic-face :weight black :foreground "#79c6ff")
;;'(markdown-list-face :weight black :foreground "#BD93F9")
;;'(markdown-bold-face :weight black :foreground "#A061F9"))
#+end_src

*** Markdown: Functions To Allow Markdown preview whilst typing:
:PROPERTIES:
:ID:       4e16c322-0c20-4d06-b4ca-6cadd0622c6a
:END:
#+begin_src emacs-lisp

;; Enables markdown preview whilst creating doc.

;; (defvar nb/current-line '(0 . 0)
;;   "(start . end) of current line in current buffer")
;; (make-variable-buffer-local 'nb/current-line)
;;
;; (defun nb/unhide-current-line (limit)
;;   "Font-lock function"
;;   (let ((start (max (point) (car nb/current-line)))
;;         (end (min limit (cdr nb/current-line))))
;;     (when (< start end)
;;       (remove-text-properties start end
;;                       '(invisible t display "" composition ""))
;;       (goto-char limit)
;;       t)))
;;
;; (defun nb/refontify-on-linemove ()
;;   "Post-command-hook"
;;   (let* ((start (line-beginning-position))
;;          (end (line-beginning-position 2))
;;          (needs-update (not (equal start (car nb/current-line)))))
;;     (setq nb/current-line (cons start end))
;;     (when needs-update
;;       (font-lock-fontify-block 3))))
;;
;; (defun nb/markdown-unhighlight ()
;;   "Enable markdown concealling"
;;   (interactive)
;;   (markdown-toggle-markup-hiding 'toggle)
;;   (font-lock-add-keywords nil '((nb/unhide-current-line)) t)
;;   (add-hook 'post-command-hook #'nb/refontify-on-linemove nil t))

;; Toggles on for all MD docs. Remove to turn off.

;; (add-hook 'markdown-mode-hook #'nb/markdown-unhighlight)

;; Enable code block syntax highlight

;; (setq markdown-enable-highlighting-syntax t)

;; Enable wiki links in all md files by default:

;; (setq markdown-enable-wiki-links t)

#+end_src
*** Markdown: Keymaps:
:PROPERTIES:
:ID:       f8a304da-3296-4fde-984f-c163db4f9307
:END:
#+begin_src emacs-lisp
; Make emacs auto indent when we create a new list item.
;;(setq markdown-indent-on-enter 'indent-and-new-item)
#+end_src

** Quality Of Life:
:PROPERTIES:
:ID:       9738f0a2-351e-4da6-a97b-cc4951baa6be
:END:
*** Save Easier:
:PROPERTIES:
:ID:       a75ea2ec-7719-4c6a-9748-85a7ff4c5305
:END:
- Stolen from https://github.com/elken/doom
#+begin_src emacs-lisp
;Back to a simpler time…
(map! :g "C-s" #'save-buffer)
#+end_src
*** Search Easier:
:PROPERTIES:
:ID:       4d3c1652-3dd3-42ae-b5d6-b0c80f14cf9e
:END:
- Stolen from https://github.com/elken/doom
#+begin_src emacs-lisp
; Search easily
(map! :after evil :gnvi "C-f" #'consult-line)
#+end_src
*** Remove line numbers to speed up scrolling:
:PROPERTIES:
:ID:       3ce5efb1-e81d-46bf-a121-deeb239ccf9d
:END:
#+begin_src shell
;;(setq display-line-numbers-type nil)
#+end_src
